<a href="https://colab.research.google.com/github/joohoshin/Python_Basic/blob/master/13_2_%EB%A7%A4%EC%B6%9C_%EA%B4%80%EB%A6%AC_%EC%98%88%EC%A0%9C.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas를 통해 매출 계산하는 예제를 만들어봅시다

In [ ]:
# 식당 매출을 가상으로 계산해봅시다
import pandas as pd
import numpy as np

# 가상 데이터 생성
월 = range(1,13)
돈까스 = np.random.choice(range(100,200), 12)
냉면 = np.random.choice(range(100,200), 12)
떡볶이 = np.random.choice(range(100,200), 12)

In [ ]:
돈까스

array([110, 116, 155, 187, 162, 155, 120, 177, 110, 128, 110, 150])

In [ ]:
# dataframe 변환
매출건수 = pd.DataFrame({'월':월, '돈까스':돈까스, '냉면':냉면, '떡볶이':떡볶이 })

In [ ]:
매출건수

     월  돈까스   냉면  떡볶이
0    1  110  160  136
1    2  116  190  180
2    3  155  192  173
3    4  187  194  135
4    5  162  182  161
5    6  155  156  137
6    7  120  150  126
7    8  177  100  101
8    9  110  174  193
9   10  128  198  127
10  11  110  143  155
11  12  150  193  168

In [ ]:
# 가격과 이익률이 아래와 같다고 합시다
가격 = {'돈까스':7000, '냉면':6000, '떡볶이':4000}
이익률 = {'돈까스':0.3, '냉면':0.5, '떡볶이':0.4}

In [ ]:
# 매출 계산
매출 = 매출건수.assign(돈까스 = 매출건수.돈까스 * 가격['돈까스'],
                 냉면 = 매출건수.냉면 * 가격['냉면'],
                 떡볶이 = 매출건수.떡볶이 * 가격['떡볶이'])

In [ ]:
매출

     월      돈까스       냉면     떡볶이
0    1   770000   960000  544000
1    2   812000  1140000  720000
2    3  1085000  1152000  692000
3    4  1309000  1164000  540000
4    5  1134000  1092000  644000
5    6  1085000   936000  548000
6    7   840000   900000  504000
7    8  1239000   600000  404000
8    9   770000  1044000  772000
9   10   896000  1188000  508000
10  11   770000   858000  620000
11  12  1050000  1158000  672000

In [ ]:
이익 = 매출.assign(돈까스 = 매출.돈까스 * 이익률['돈까스'],
               냉면 = 매출.냉면 * 이익률['냉면'],
               떡볶이 = 매출.떡볶이 * 이익률['떡볶이'])

In [ ]:
이익

     월       돈까스        냉면       떡볶이
0    1  231000.0  480000.0  217600.0
1    2  243600.0  570000.0  288000.0
2    3  325500.0  576000.0  276800.0
3    4  392700.0  582000.0  216000.0
4    5  340200.0  546000.0  257600.0
5    6  325500.0  468000.0  219200.0
6    7  252000.0  450000.0  201600.0
7    8  371700.0  300000.0  161600.0
8    9  231000.0  522000.0  308800.0
9   10  268800.0  594000.0  203200.0
10  11  231000.0  429000.0  248000.0
11  12  315000.0  579000.0  268800.0

In [ ]:
# 총매출과 총이익, 이익률을 계산해봅시다
이익 = 이익.assign(총매출 = 매출.돈까스 + 매출.냉면 + 매출.떡볶이)
이익 = 이익.assign(총이익 = 이익.돈까스 + 이익.냉면 + 이익.떡볶이)
이익 = 이익.assign(이익률 = 이익.총이익 / 이익.총매출)

In [ ]:
이익

     월       돈까스        냉면       떡볶이      총매출        총이익       이익률
0    1  231000.0  480000.0  217600.0  2274000   928600.0  0.408355
1    2  243600.0  570000.0  288000.0  2672000  1101600.0  0.412275
2    3  325500.0  576000.0  276800.0  2929000  1178300.0  0.402287
3    4  392700.0  582000.0  216000.0  3013000  1190700.0  0.395188
4    5  340200.0  546000.0  257600.0  2870000  1143800.0  0.398537
5    6  325500.0  468000.0  219200.0  2569000  1012700.0  0.394200
6    7  252000.0  450000.0  201600.0  2244000   903600.0  0.402674
7    8  371700.0  300000.0  161600.0  2243000   833300.0  0.371511
8    9  231000.0  522000.0  308800.0  2586000  1061800.0  0.410596
9   10  268800.0  594000.0  203200.0  2592000  1066000.0  0.411265
10  11  231000.0  429000.0  248000.0  2248000   908000.0  0.403915
11  12  315000.0  579000.0  268800.0  2880000  1162800.0  0.403750

In [ ]:
# 구글 드라이브 연동을 위해 필요
from google.colab import drive
drive.mount('/g') #구글 드라이브를 임의의 명칭으로 지정합니다
# 구글 로그인을 위한 인증코드를 받아서 입력해줍니다

Drive already mounted at /g; to attempt to forcibly remount, call drive.mount("/g", force_remount=True).

In [ ]:
# csv 파일로 저장해봅시다
이익.to_csv('/g/My Drive/Python_202002/매출 요약.csv', encoding = 'cp949', index = False)

In [ ]:
# 가장 매출이 높은 월을 찾아봅시다
top_sales = 이익.sort_values('총매출', ascending = False)
print('매출 높은 월')
top_sales.head()

매출 높은 월

     월       돈까스        냉면       떡볶이      총매출        총이익       이익률
3    4  392700.0  582000.0  216000.0  3013000  1190700.0  0.395188
2    3  325500.0  576000.0  276800.0  2929000  1178300.0  0.402287
11  12  315000.0  579000.0  268800.0  2880000  1162800.0  0.403750
4    5  340200.0  546000.0  257600.0  2870000  1143800.0  0.398537
1    2  243600.0  570000.0  288000.0  2672000  1101600.0  0.412275

In [ ]:
# 냉면 판매건수가 가장 큰달만 출력
print('냉면이 가장 많이 팔린 월')
냉면최고 = 매출건수.query('냉면> 돈까스 & 냉면> 떡볶이')
냉면최고

냉면이 가장 많이 팔린 월

     월  돈까스   냉면  떡볶이
0    1  110  160  136
1    2  116  190  180
2    3  155  192  173
3    4  187  194  135
4    5  162  182  161
5    6  155  156  137
6    7  120  150  126
9   10  128  198  127
11  12  150  193  168